namespace ConsoleApp_Day21
{   /***********************************************
    [깃(Git)]
    - 버전 관리 시스템(Version Control System)
    - 단순히 프로젝트를 백업(저장)하는 것 뿐 아니라
        언제, 누가, 어떤 내용을 수정했는지 파악이 가능하고,
        이전 버전으로 돌아가거나,
        협업을 할 수 있다.
    
    [장점]
    - 압도적인 개발 생태계 (커뮤니티)
    - 비용 : 일반적인 소규모 개발 프로젝트에 있어서는 무료다.

    [유니티 관련 사항]
    - 용량 : 매우 크다.
     ㄴ gitignore 사용
     ㄴ 유니티 폴더 중 Scripts 폴더만 지정

    [Git vs GitHub]
    Git : 시스템 자체
    GitHub : Git을 기반으로 한 원격 저장소

    [Git 접근 방식]
    CLI : 터미널에서 Git 명령어를 사용하는 방식
    Desktop : GUI
    SourceTree : GUI

    [키워드]
    - Repository : 프로젝트의 모든 파일과 변경 이력을 저장하는 공간
     ㄴ repo : 프로젝트
    - Local / Remote Repository : 로컬 컴퓨터 / 원격 서버에 저장된 저장소
    - Branch : 독립적인 작업 공간을 만들어서 여러 작업을 동시에 진행할 수 있게 하는 기능
    - Check Out : 특정 브랜치나 커밋으로 작업 공간을 전환하는 작업
    - Commit : 변경 사항을 저장소에 기록하는 작업
     ㄴ Commit Message : 변경 사항에 대한 설명
     ㄴ Summary : 요약
    - Push : Commit한 데이터를 원격 서버에 저장된 저장소에 저장하는 작업
    - Fetch : 원격 서버에 저장된 저장소에서 로컬 컴퓨터에 저장된 저장소로 가져오는 작업
    - Pull : 원격 서버에 저장된 저장소에서 내가 작업하는 저장소로 가져오는 작업

    [.gitignore]

    [충돌(conflict)]
     - 여러 사람이 같은 파일의 같은 부분을 수정했을 때 생기는 문제
    ***********************************************/
    internal class Program01
    {
    }
}
