namespace ConsoleApp_Day16
{   /************************************************
    [객체지향 설계 원칙(SOLID 원칙)]
    - 객체지향 프로그래망(OOP)에서 유지보수성/확장성을 높이기 위한 5가지의 설계 원칙

    =================================================
    [S(SRP: Single Resonsibility Principle) - 단일 책임 원칙]
    - 하나의 클래스는 하나의 책임만 가져야 한다.

    [O(OCP: Open Closed Principle) - 개방 폐쇄 원칙]
    - 확장은 열려있고, 수정은 닫혀있어야 한다.

    [L(LSP: Liskov Substitution Principle) - 리스코프 치환 원칙]
    - 자식 클래스는 부모 클래스를 대체할 수 있어야 한다.

    [I(ISP: Interface Segregation Principle) - 인터페이스 분리 원칙]
    - 클라이언트가 자신이 사용하지 않는 인터페이스에 의존하면 안 된다.

    [D(DIP: Dependency Inversion Principle) - 의존성 역전 원칙]
    - 구체적인 클래스가 아닌 추상적인 인터페이스에 의존해야 한다.
    =================================================

    [적용 이유]
    - 프로젝트 규모가 커질 수록 코드가 복잡해진다.
    - 기능 추가 시 기존 코드가 자주 망가질 수 있다.
    - 여러 사람이 협업할 경우 유지보수가 어려워진다.

    [장점]
    - 유지보수가 쉬워진다.
    - 기능 확장이 쉬워진다.
    - 버그 발생 가능성을 감소시킬 수 있다.
    - 코드 재사용성이 높아진다.

    ************************************************/
    internal class Program
    {
        static void Main(string[] args)
        {

        }
    }
}
